In [1]:
import sqlite3

In [2]:
db = "../databases/packages.db"

In [3]:
%load_ext sql
%config SqlMagic.feedback=False
%sql sqlite:///{db}?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///../databases/packages.db?check_same_thread=false

[('addresses',), ('packages',), ('drivers',), ('scans',)]

In [4]:
%sql SELECT * FROM "addresses" LIMIT 10;

 * sqlite:///../databases/packages.db?check_same_thread=false

[(1, '7660 Sharon Street', 'Residential'),
 (2, '60 Drake Place', 'Residential'),
 (3, '88 City Point Court', 'Residential'),
 (4, '266 Dorchester Avenue', 'Residential'),
 (5, '2 Otis Place', 'Residential'),
 (6, '154 Lowell Court', 'Residential'),
 (7, '9 Marlborough Street', 'Residential'),
 (8, '8335 Kilby Place', 'Residential'),
 (9, '26 Fenway', 'Business'),
 (10, '81 Fleet Street', 'Residential')]

In [5]:
%sql SELECT * FROM "packages" LIMIT 10;

 * sqlite:///../databases/packages.db?check_same_thread=false

[(1, 'Sticky notes', 8575, 4635),
 (2, 'Shears', 8431, 7641),
 (3, 'Index cards', 2107, 3624),
 (4, 'Glue stick', 6954, 3740),
 (5, 'Trading cards', 4530, 5564),
 (6, 'Fountain pen', 2308, 972),
 (7, 'Trading cards', 7870, 7942),
 (8, 'Ironing board', 4572, 8454),
 (9, 'Fountain pen', 8399, 416),
 (10, 'Colored cardstock', 7325, 8572)]

In [6]:
%sql SELECT * FROM "drivers" LIMIT 10;

 * sqlite:///../databases/packages.db?check_same_thread=false

[(1, 'Matthew'),
 (2, 'Isabel'),
 (3, 'Julianna'),
 (4, 'Varsha'),
 (5, 'Jacob'),
 (6, 'Kamryn'),
 (7, 'Derek'),
 (8, 'Elizabeth'),
 (9, 'Phyllis'),
 (10, 'Josephine')]

In [7]:
%sql SELECT * FROM "scans" LIMIT 10;

 * sqlite:///../databases/packages.db?check_same_thread=false

[(1, 11, 8502, 1063, 'Pick', '2023-07-11 15:16:05.340221'),
 (2, 8, 3320, 9551, 'Pick', '2023-07-11 15:19:39.359315'),
 (3, 1, 2879, 9589, 'Pick', '2023-07-11 15:23:47.208594'),
 (4, 20, 2240, 3464, 'Pick', '2023-07-11 15:28:16.920400'),
 (5, 1, 8664, 8013, 'Pick', '2023-07-11 15:32:42.265139'),
 (6, 9, 6932, 8082, 'Pick', '2023-07-11 15:35:55.724893'),
 (7, 5, 9033, 678, 'Pick', '2023-07-11 15:42:30.255444'),
 (8, 4, 1722, 673, 'Pick', '2023-07-11 15:47:40.269239'),
 (9, 18, 3629, 4065, 'Pick', '2023-07-11 15:54:06.711657'),
 (10, 13, 860, 8557, 'Pick', '2023-07-11 15:58:04.571587')]

<a data-id="" id="problem-to-solve" style="top: -57.4667px;"></a><h2><a data-id="" href="#problem-to-solve">Problem to Solve</a></h2>

<p>You are a <a href="https://www.ziprecruiter.com/career/Mail-Clerk/What-Is-How-to-Become">mail clerk</a> for the city of Boston and, as such, you oversee the delivery of mail across the city. For the most part, all packages sent are eventually delivered. Except, every once in while, a mystery falls into your lap: a missing package! For each customer that comes to you with a report of a missing package, your job is to determine:</p>

<ul class="fa-ul">
  <li data-marker="*"><span class="fa-li"><i class="fas fa-square"></i></span>The current address (or location!) of their missing package</li>
  <li data-marker="*"><span class="fa-li"><i class="fas fa-square"></i></span>The type of address or location (e.g. residential, business, etc.)</li>
  <li data-marker="*"><span class="fa-li"><i class="fas fa-square"></i></span>The contents of the package</li>
</ul>

<p>All you know is what the customers themselves will tell you. To solve each mystery, you’ll need to use the mail delivery service’s database, <code class="language-plaintext highlighter-rouge">packages.db</code>, which contains data on the transit of packages around the city. Using just the information in the database, your task is to help each customer find their missing package.</p>

## First Problem
Your first report of a missing package comes from Anneke. Anneke walks up to your counter and tells you the following:

    Clerk, my name’s Anneke. I live over at 900 Somerville Avenue. Not long ago, I sent out a special letter. It’s meant for my friend Varsha. She’s starting a new chapter of her life at 2 Finnegan Street, uptown. (That address, let me tell you: it was a bit tricky to get right the first time.) The letter is a congratulatory note—a cheery little paper hug from me to her, to celebrate this big move of hers. Can you check if it’s made its way to her yet?

In `log.sql`, underneath -- \*\*\* The Lost Letter \*\*\*, keep track of the SQL queries you use to find Anneke’s lost letter. Once you’ve found it, describe it per the questions in answers.txt.

### Answers:
At what type of address did the Lost Letter end up?: Residential  
At what address did the Lost Letter end up?: 2 Finnigan Street

In [8]:
%%sql
SELECT "address", "type" FROM "addresses"
WHERE "id" = (
    SELECT "to_address_id" FROM "packages"
    WHERE "contents" = 'Congratulatory letter'
);

 * sqlite:///../databases/packages.db?check_same_thread=false

[('2 Finnigan Street', 'Residential')]

## Second Problem
Your second report of a missing package comes from a mysterious fellow from out of town. They walk up to your counter and tell you the following:

    Good day to you, deliverer of the mail. You might remember that not too long ago I made my way over from the town of Fiftyville. I gave a certain box into your reliable hands and asked you to keep things low. My associate has been expecting the package for a while now. And yet, it appears to have grown wings and flown away. Ha! Any chance you could help clarify this mystery? Afraid there’s no “From” address. It’s the kind of parcel that would add a bit more… quack to someone’s bath times, if you catch my drift.

In log.sql, underneath -- *** The Devious Delivery ***, keep track of the SQL queries you use to find the package. Once you’ve found it, describe it per the questions in answers.txt.

### Answers:
At what type of address did the Devious Delivery end up?: Police Station  
What were the contents of the Devious Delivery?: Duck debugger

In [9]:
%%sql
SELECT "type" FROM "addresses"
WHERE "id" = (
    SELECT "address_id" FROM "scans"
    WHERE "package_id" = (
        SELECT "id" FROM "packages"
        WHERE "from_address_id" IS NULL
        AND "action" = "Drop"
    )
);

 * sqlite:///../databases/packages.db?check_same_thread=false

[('Police Station',)]

In [10]:
%%sql
SELECT "contents" FROM "packages"
WHERE "from_address_id" IS NULL;

 * sqlite:///../databases/packages.db?check_same_thread=false

[('Duck debugger',)]

## Third Problem
The Forgotten Gift
Your third report of a missing package comes from a grandparent who lives down the street from the post office. They approach your counter and tell you the following:

    Oh, excuse me, Clerk. I had sent a mystery gift, you see, to my wonderful granddaughter, off at 728 Maple Place. That was about two weeks ago. Now the delivery date has passed by seven whole days and I hear she still waits, her hands empty and heart filled with anticipation. I’m a bit worried wondering where my package has gone. I cannot for the life of me remember what’s inside, but I do know it’s filled to the brim with my love for her. Can we possibly track it down so it can fill her day with joy? I did send it from my home at 109 Tileston Street.

In log.sql, underneath -- *** The Forgotten Gift ***, keep track of the SQL queries you use to find the gift. Once you’ve found it, describe it per the questions in answers.txt.

### Answers: 
What are the contents of the Forgotten Gift?: Flowers  
Who has the Forgotten Gift?: Mikel

In [11]:
%%sql 
SELECT "contents" FROM "packages"
WHERE "from_address_id" = (
    SELECT "id" FROM "addresses"
    WHERE "address" = '109 Tileston Street'
)
AND "to_address_id" = (
    SELECT "id" FROM "addresses"
    WHERE "address" = '728 Maple Place'
);

 * sqlite:///../databases/packages.db?check_same_thread=false

[('Flowers',)]

In [12]:
%%sql
SELECT "name", "action"
FROM "drivers"
JOIN "scans" ON "drivers"."id" = "scans"."driver_id"
WHERE "package_id" = (
    SELECT "id" FROM "packages"
    WHERE "from_address_id" = (
        SELECT "id" FROM "addresses"
        WHERE "address" = '109 Tileston Street'
    )
);

 * sqlite:///../databases/packages.db?check_same_thread=false

[('Maegan', 'Pick'), ('Maegan', 'Drop'), ('Mikel', 'Pick')]